workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/scxfs_8dev_8KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 74349
[OVERALL], Throughput(ops/sec), 34432.20487161899
[TOTAL_GCS_G1_Young_Generation], Count, 94
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 333
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4478876649316063
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 94
[TOTAL_GC_TIME], Time(ms), 333
[TOTAL_GC_TIME_%], Time(%), 0.4478876649316063
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8754.734375
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 560127
[CLEANUP], 95thPercentileLatency(us), 16
[CLEANUP], 99thPercentileLatency(us), 25
[INSERT], Operations, 2560000
[INSERT], AverageLatency(us), 1832.62263984375
[INSERT], MinLatency(us), 31
[INSERT], MaxLatency(us), 50879
[INSERT], 95thPercentileLatency(us), 2233
[INSERT], 99thPercentileLatency(us), 2667
[INSERT], Return=OK, 2560000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 80113
[OVERALL], Throughput(ops/sec), 31954.86375494614
[TOTAL_GCS_G1_Young_Generation], Count, 67
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 422
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5267559572104402
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 67
[TOTAL_GC_TIME], Time(ms), 422
[TOTAL_GC_TIME_%], Time(%), 0.5267559572104402
[READ], Operations, 1278975
[READ], AverageLatency(us), 202.48450282452745
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 84799
[READ], 95thPercentileLatency(us), 523
[READ], 99thPercentileLatency(us), 1075
[READ], Return=OK, 1278975
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 5016.703125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 320767
[CLEANUP], 95thPercentileLatency(us), 15
[CLEANUP], 99thPercentileLatency(us), 31
[UPDATE], Operations, 1281025
[UPDATE], AverageLatency(us), 3731.8391069651257
[UPDATE], MinLatency(us), 29
[UPDATE], MaxLatency(us), 92095
[UPDATE], 95thPercentileLatency(us), 5311
[UPDATE], 99thPercentileLatency(us), 68927
[UPDATE], Return=OK, 1281025
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 34767
[OVERALL], Throughput(ops/sec), 73633.04282796905
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 304
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8743923835821324
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 304
[TOTAL_GC_TIME_%], Time(%), 0.8743923835821324
[READ], Operations, 1279303
[READ], AverageLatency(us), 275.25496930750575
[READ], MinLatency(us), 3
[READ], MaxLatency(us), 21519
[READ], 95thPercentileLatency(us), 671
[READ], 99thPercentileLatency(us), 907
[READ], Return=OK, 1279303
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7994.984375
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 511231
[CLEANUP], 95thPercentileLatency(us), 21
[CLEANUP], 99thPercentileLatency(us), 86
[UPDATE], Operations, 1280697
[UPDATE], AverageLatency(us), 1358.901495826101
[UPDATE], MinLatency(us), 29
[UPDATE], MaxLatency(us), 22975
[UPDATE], 95thPercentileLatency(us), 2167
[UPDATE], 99thPercentileLatency(us), 3091
[UPDATE], Return=OK, 1280697
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 58452
[OVERALL], Throughput(ops/sec), 43796.61944843632
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 409
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6997194279066585
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 409
[TOTAL_GC_TIME_%], Time(%), 0.6997194279066585
[READ], Operations, 1280941
[READ], AverageLatency(us), 210.60663371693153
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 100671
[READ], 95thPercentileLatency(us), 562
[READ], 99thPercentileLatency(us), 1224
[READ], Return=OK, 1280941
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7293.671875
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 466431
[CLEANUP], 95thPercentileLatency(us), 17
[CLEANUP], 99thPercentileLatency(us), 80
[UPDATE], Operations, 1279059
[UPDATE], AverageLatency(us), 2617.948425365835
[UPDATE], MinLatency(us), 30
[UPDATE], MaxLatency(us), 108351
[UPDATE], 95thPercentileLatency(us), 3787
[UPDATE], 99thPercentileLatency(us), 44223
[UPDATE], Return=OK, 1279059
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 42858
[OVERALL], Throughput(ops/sec), 59732.13869055952
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 306
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7139857202855944
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 306
[TOTAL_GC_TIME_%], Time(%), 0.7139857202855944
[READ], Operations, 1281129
[READ], AverageLatency(us), 293.83999581619025
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 24847
[READ], 95thPercentileLatency(us), 802
[READ], 99thPercentileLatency(us), 1176
[READ], Return=OK, 1281129
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 2906.71875
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 185599
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 57
[UPDATE], Operations, 1278871
[UPDATE], AverageLatency(us), 1766.875860817862
[UPDATE], MinLatency(us), 29
[UPDATE], MaxLatency(us), 37087
[UPDATE], 95thPercentileLatency(us), 2867
[UPDATE], 99thPercentileLatency(us), 8015
[UPDATE], Return=OK, 1278871
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 42203
[OVERALL], Throughput(ops/sec), 60659.194843968435
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 337
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7985214321256783
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 337
[TOTAL_GC_TIME_%], Time(%), 0.7985214321256783
[READ], Operations, 1280013
[READ], AverageLatency(us), 297.94564195832385
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 50943
[READ], 95thPercentileLatency(us), 785
[READ], 99thPercentileLatency(us), 1092
[READ], Return=OK, 1280013
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3586.15625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 229119
[CLEANUP], 95thPercentileLatency(us), 20
[CLEANUP], 99thPercentileLatency(us), 38
[UPDATE], Operations, 1279987
[UPDATE], AverageLatency(us), 1723.4711110347214
[UPDATE], MinLatency(us), 30
[UPDATE], MaxLatency(us), 76863
[UPDATE], 95thPercentileLatency(us), 2739
[UPDATE], 99thPercentileLatency(us), 7327
[UPDATE], Return=OK, 1279987
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 44733
[OVERALL], Throughput(ops/sec), 57228.444325218516
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 291
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6505264569780699
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 291
[TOTAL_GC_TIME_%], Time(%), 0.6505264569780699
[READ], Operations, 1278514
[READ], AverageLatency(us), 311.4417863238103
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 20543
[READ], 95thPercentileLatency(us), 795
[READ], 99thPercentileLatency(us), 1088
[READ], Return=OK, 1278514
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 13344.765625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 853503
[CLEANUP], 95thPercentileLatency(us), 36
[CLEANUP], 99thPercentileLatency(us), 86
[UPDATE], Operations, 1281486
[UPDATE], AverageLatency(us), 1800.8227245557111
[UPDATE], MinLatency(us), 30
[UPDATE], MaxLatency(us), 44543
[UPDATE], 95thPercentileLatency(us), 2731
[UPDATE], 99thPercentileLatency(us), 26831
[UPDATE], Return=OK, 1281486
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 60457
[OVERALL], Throughput(ops/sec), 42344.14542567445
[TOTAL_GCS_G1_Young_Generation], Count, 66
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 420
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6947086358899713
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 66
[TOTAL_GC_TIME], Time(ms), 420
[TOTAL_GC_TIME_%], Time(%), 0.6947086358899713
[READ], Operations, 1280374
[READ], AverageLatency(us), 241.9148530038879
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 69631
[READ], 95thPercentileLatency(us), 765
[READ], 99thPercentileLatency(us), 1652
[READ], Return=OK, 1280374
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6055.984375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 387327
[CLEANUP], 95thPercentileLatency(us), 14
[CLEANUP], 99thPercentileLatency(us), 27
[UPDATE], Operations, 1279626
[UPDATE], AverageLatency(us), 2687.272225634678
[UPDATE], MinLatency(us), 27
[UPDATE], MaxLatency(us), 77695
[UPDATE], 95thPercentileLatency(us), 4355
[UPDATE], 99thPercentileLatency(us), 44031
[UPDATE], Return=OK, 1279626
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 43286
[OVERALL], Throughput(ops/sec), 59141.52381832463
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 335
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7739222843413575
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 335
[TOTAL_GC_TIME_%], Time(%), 0.7739222843413575
[READ], Operations, 1279815
[READ], AverageLatency(us), 306.24213030789605
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 24095
[READ], 95thPercentileLatency(us), 852
[READ], 99thPercentileLatency(us), 1232
[READ], Return=OK, 1279815
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 7772.625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 497151
[CLEANUP], 95thPercentileLatency(us), 18
[CLEANUP], 99thPercentileLatency(us), 21
[UPDATE], Operations, 1280185
[UPDATE], AverageLatency(us), 1753.4704507551644
[UPDATE], MinLatency(us), 28
[UPDATE], MaxLatency(us), 37311
[UPDATE], 95thPercentileLatency(us), 2861
[UPDATE], 99thPercentileLatency(us), 8591
[UPDATE], Return=OK, 1280185
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 38003
[OVERALL], Throughput(ops/sec), 67363.10291292792
[TOTAL_GCS_G1_Young_Generation], Count, 66
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 300
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.7894113622608742
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 66
[TOTAL_GC_TIME], Time(ms), 300
[TOTAL_GC_TIME_%], Time(%), 0.7894113622608742
[READ], Operations, 1280434
[READ], AverageLatency(us), 356.47337387167164
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 21439
[READ], 95thPercentileLatency(us), 987
[READ], 99thPercentileLatency(us), 1454
[READ], Return=OK, 1280434
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 8372.765625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 535551
[CLEANUP], 95thPercentileLatency(us), 17
[CLEANUP], 99thPercentileLatency(us), 133
[UPDATE], Operations, 1279566
[UPDATE], AverageLatency(us), 1438.421971981125
[UPDATE], MinLatency(us), 32
[UPDATE], MaxLatency(us), 38719
[UPDATE], 95thPercentileLatency(us), 2261
[UPDATE], 99thPercentileLatency(us), 3403
[UPDATE], Return=OK, 1279566
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 61492
[OVERALL], Throughput(ops/sec), 41631.43173095687
[TOTAL_GCS_G1_Young_Generation], Count, 68
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 415
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6748845378260587
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 68
[TOTAL_GC_TIME], Time(ms), 415
[TOTAL_GC_TIME_%], Time(%), 0.6748845378260587
[READ], Operations, 1280877
[READ], AverageLatency(us), 226.90852829740874
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 48767
[READ], 95thPercentileLatency(us), 633
[READ], 99thPercentileLatency(us), 1285
[READ], Return=OK, 1280877
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 4240.234375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 271103
[CLEANUP], 95thPercentileLatency(us), 16
[CLEANUP], 99thPercentileLatency(us), 18
[UPDATE], Operations, 1279123
[UPDATE], AverageLatency(us), 2761.510306671055
[UPDATE], MinLatency(us), 34
[UPDATE], MaxLatency(us), 72191
[UPDATE], 95thPercentileLatency(us), 4283
[UPDATE], 99thPercentileLatency(us), 44895
[UPDATE], Return=OK, 1279123
*---------------------------------- ycsb run end ------------------------------*
experiment end.